In [1]:
import pandas as pd

# Employee table
employee_data = {
    'id': [1, 2, 3, 4, 5],
    'name': ['Joe', 'Jim', 'Henry', 'Sam', 'Max'],
    'salary': [70000, 90000, 80000, 60000, 90000],
    'departmentId': [1, 1, 2, 2, 1]
}

employee_df = pd.DataFrame(employee_data)

# Department table
department_data = {
    'id': [1, 2],
    'name': ['IT', 'Sales']
}

department_df = pd.DataFrame(department_data)

# Rename department.id to match for merging clarity if needed
department_df.rename(columns={'id': 'departmentId', 'name': 'departmentName'}, inplace=True)

# Display DataFrames
print("Employee DataFrame:")
print(employee_df)

print("\nDepartment DataFrame:")
print(department_df)

Employee DataFrame:
   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

Department DataFrame:
   departmentId departmentName
0             1             IT
1             2          Sales

In [7]:
employee_df

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [8]:
depa

NameError: name 'depa' is not defined

In [9]:
department_df

   departmentId departmentName
0             1             IT
1             2          Sales

In [13]:
merged = employee_df.merge(department_df, left_on = 'departmentId', right_on = 'departmentId', how='inner')
merged

   id   name  salary  departmentId departmentName
0   1    Joe   70000             1             IT
1   2    Jim   90000             1             IT
2   3  Henry   80000             2          Sales
3   4    Sam   60000             2          Sales
4   5    Max   90000             1             IT

In [17]:
grouped = merged.groupby('departmentId')['salary'].max()

In [18]:
grouped

departmentId
1    90000
2    80000
Name: salary, dtype: int64